using Microsoft.EntityFrameworkCore.Metadata;
using Microsoft.EntityFrameworkCore.Migrations;

namespace EducationalWebGame.Migrations
{
    public partial class InitialCreate : Migration
    {
        protected override void Up(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.CreateTable(
                name: "GameTypes",
                columns: table => new
                {
                    Id = table.Column<int>(nullable: false)
                        .Annotation("SqlServer:ValueGenerationStrategy", SqlServerValueGenerationStrategy.IdentityColumn),
                    GameTypeName = table.Column<string>(maxLength: 100, nullable: false)
                },
                constraints: table =>
                {
                    table.PrimaryKey("PK_GameTypes", x => x.Id);
                });

            migrationBuilder.CreateTable(
                name: "ResourceTeachers",
                columns: table => new
                {
                    Id = table.Column<int>(nullable: false)
                        .Annotation("SqlServer:ValueGenerationStrategy", SqlServerValueGenerationStrategy.IdentityColumn),
                    Name = table.Column<string>(maxLength: 30, nullable: false),
                    FamilyName = table.Column<string>(maxLength: 30, nullable: false),
                    UserName = table.Column<string>(maxLength: 30, nullable: false),
                    Password = table.Column<string>(maxLength: 100, nullable: false)
                },
                constraints: table =>
                {
                    table.PrimaryKey("PK_ResourceTeachers", x => x.Id);
                });

            migrationBuilder.CreateTable(
                name: "Subjects",
                columns: table => new
                {
                    Id = table.Column<int>(nullable: false)
                        .Annotation("SqlServer:ValueGenerationStrategy", SqlServerValueGenerationStrategy.IdentityColumn),
                    SubjectName = table.Column<string>(maxLength: 100, nullable: false)
                },
                constraints: table =>
                {
                    table.PrimaryKey("PK_Subjects", x => x.Id);
                });

            migrationBuilder.CreateTable(
                name: "Teachers",
                columns: table => new
                {
                    Id = table.Column<int>(nullable: false)
                        .Annotation("SqlServer:ValueGenerationStrategy", SqlServerValueGenerationStrategy.IdentityColumn),
                    Name = table.Column<string>(maxLength: 30, nullable: false),
                    FamilyName = table.Column<string>(maxLength: 30, nullable: false),
                    UserName = table.Column<string>(maxLength: 30, nullable: false),
                    Password = table.Column<string>(maxLength: 100, nullable: false)
                },
                constraints: table =>
                {
                    table.PrimaryKey("PK_Teachers", x => x.Id);
                });

            migrationBuilder.CreateTable(
                name: "Games",
                columns: table => new
                {
                    Id = table.Column<int>(nullable: false)
                        .Annotation("SqlServer:ValueGenerationStrategy", SqlServerValueGenerationStrategy.IdentityColumn),
                    Question = table.Column<string>(maxLength: 255, nullable: false),
                    CorrectAnswer = table.Column<string>(maxLength: 255, nullable: false),
                    ExtraInfo = table.Column<string>(maxLength: 255, nullable: true),
                    ImagePath = table.Column<string>(maxLength: 255, nullable: true),
                    CoinsGiven = table.Column<long>(nullable: false),
                    PointsGiven = table.Column<long>(nullable: false),
                    GameTypeId = table.Column<int>(nullable: true),
                    SubjectId = table.Column<int>(nullable: true)
                },
                constraints: table =>
                {
                    table.PrimaryKey("PK_Games", x => x.Id);
                    table.ForeignKey(
                        name: "FK_Games_GameTypes_GameTypeId",
                        column: x => x.GameTypeId,
                        principalTable: "GameTypes",
                        principalColumn: "Id",
                        onDelete: ReferentialAction.Restrict);
                    table.ForeignKey(
                        name: "FK_Games_Subjects_SubjectId",
                        column: x => x.SubjectId,
                        principalTable: "Subjects",
                        principalColumn: "Id",
                        onDelete: ReferentialAction.Restrict);
                });

            migrationBuilder.CreateTable(
                name: "Students",
                columns: table => new
                {
                    Id = table.Column<int>(nullable: false)
                        .Annotation("SqlServer:ValueGenerationStrategy", SqlServerValueGenerationStrategy.IdentityColumn),
                    Name = table.Column<string>(maxLength: 30, nullable: false),
                    FamilyName = table.Column<string>(maxLength: 30, nullable: false),
                    UserName = table.Column<string>(maxLength: 30, nullable: false),
                    Password = table.Column<string>(maxLength: 100, nullable: false),
                    Coins = table.Column<long>(nullable: false),
                    Points = table.Column<long>(nullable: false),
                    Lives = table.Column<long>(nullable: false),
                    TeacherId = table.Column<int>(nullable: true),
                    ResourceTeacherId = table.Column<int>(nullable: true)
                },
                constraints: table =>
                {
                    table.PrimaryKey("PK_Students", x => x.Id);
                    table.ForeignKey(
                        name: "FK_Students_ResourceTeachers_ResourceTeacherId",
                        column: x => x.ResourceTeacherId,
                        principalTable: "ResourceTeachers",
                        principalColumn: "Id",
                        onDelete: ReferentialAction.Restrict);
                    table.ForeignKey(
                        name: "FK_Students_Teachers_TeacherId",
                        column: x => x.TeacherId,
                        principalTable: "Teachers",
                        principalColumn: "Id",
                        onDelete: ReferentialAction.Restrict);
                });

            migrationBuilder.CreateTable(
                name: "StudentGames",
                columns: table => new
                {
                    StudentId = table.Column<int>(nullable: false),
                    GameId = table.Column<int>(nullable: false),
                    IsCorrect = table.Column<bool>(nullable: false)
                },
                constraints: table =>
                {
                    table.PrimaryKey("PK_StudentGames", x => new { x.StudentId, x.GameId });
                    table.ForeignKey(
                        name: "FK_StudentGames_Games_GameId",
                        column: x => x.GameId,
                        principalTable: "Games",
                        principalColumn: "Id",
                        onDelete: ReferentialAction.Cascade);
                    table.ForeignKey(
                        name: "FK_StudentGames_Students_StudentId",
                        column: x => x.StudentId,
                        principalTable: "Students",
                        principalColumn: "Id",
                        onDelete: ReferentialAction.Cascade);
                });

            migrationBuilder.InsertData(
                table: "GameTypes",
                columns: new[] { "Id", "GameTypeName" },
                values: new object[,]
                {
                    { 1, "Бесеница" },
                    { 2, "Подреди думата" },
                    { 3, "Балони" },
                    { 4, "Викторина" },
                    { 5, "Шифър" }
                });

            migrationBuilder.InsertData(
                table: "Subjects",
                columns: new[] { "Id", "SubjectName" },
                values: new object[,]
                {
                    { 1, "Човекът и природата" },
                    { 2, "Човекът и обществото" }
                });

            migrationBuilder.InsertData(
                table: "Games",
                columns: new[] { "Id", "CoinsGiven", "CorrectAnswer", "ExtraInfo", "GameTypeId", "ImagePath", "PointsGiven", "Question", "SubjectId" },
                values: new object[,]
                {
                    { 1, 30L, "В О Д А", null, 1, null, 30L, "Вещество, което разтваря някои вещества, а други не, не гори и не поддържа горенето.", 1 },
                    { 62, 20L, "ВИТОША", "АВШИОТ", 2, null, 20L, "В коя планина се намира Черни връх. Висок е 2290 м.", 2 },
                    { 63, 30L, "БОГДАН", "НБОАГД", 2, null, 30L, "Най-високият връх в Средна гора.", 2 },
                    { 64, 20L, "СИНАГОГА", "АСИГНОАГ", 2, null, 20L, "Еврейски молитвен дом.", 2 },
                    { 65, 10L, "ДЕЛФИН", "НДЕИЛФ", 2, null, 10L, "Морски обитател във водите на Черно море. Много красив морски бозайник.", 2 },
                    { 66, 30L, "МУФЛОН", "НМУОЛФ", 2, null, 30L, "Застрашено от изчезване животно, вписано в Червената книга на България.", 2 },
                    { 67, 10L, "БУРГАС", "СБУАГР", 2, null, 10L, "Град на Черноморското ни крайбрежие, където се добива морска сол.", 2 },
                    { 68, 20L, "МУРА", "УРАМ", 2, null, 20L, "Вид иглолистно дърво .", 2 },
                    { 69, 30L, "ПЛОВДИВ", "ВПЛДВОИ", 2, null, 30L, "В кой български град на 6 септември 1885 година било провъзгласено Съединението на България?", 2 },
                    { 61, 10L, "ВАРНА", "АВНАР", 2, null, 10L, "Голямо пристанище на Черноморското ни крайбрежие. Наричаме града \"морската столица\" на България.", 2 },
                    { 70, 10L, "ЧАЙКА", "АКЧЙА", 2, null, 10L, "Птица, живееща по бреговете, реките и езерата на Черноморското ни крайбрежие.", 2 },
                    { 72, 30L, "ЛЕДЕНИКА", "АЛЕКИДНЕ", 2, null, 30L, "Пещера в Стара планина.", 2 },
                    { 91, 10L, "Искър е най-дългата българска река.", null, 3, null, 10L, "Подредете думите в изречение!", 2 },
                    { 92, 20L, "Добруджа е житницата на България.", null, 3, null, 20L, "Подредете думите в изречение!", 2 },
                    { 93, 30L, "Град Добрич се намира в Дунавската равнина.", null, 3, null, 30L, "Подредете думите в изречение!", 2 },
                    { 94, 10L, "Мурата е иглолистно дърво.", null, 3, null, 10L, "Подредете думите в изречение!", 2 },
                    { 95, 20L, "София е столица на България.", null, 3, null, 20L, "Подредете думите в изречение!", 2 },
                    { 96, 30L, "България се намира в Европа.", null, 3, null, 30L, "Подредете думите в изречение!", 2 },
                    { 97, 10L, "Сребърна е резерват.", null, 3, null, 10L, "Подредете думите в изречение!", 2 },
                    { 71, 20L, "ТРОЯН", "НТРЯО", 2, null, 20L, "Град в България, известен с развитието на занаятите, основно грънчарство .", 2 },
                    { 60, 30L, "КОТЕЛ", "ЛКОЕТ", 2, null, 30L, "Град в България, известен с развитието на тъкачеството.", 2 },
                    { 59, 20L, "ЯНТРА", "АТЯРН", 2, null, 20L, "Река, извираща от Стара планина. Минава през град Габрово.", 2 },
                    { 58, 10L, "ДЕВИН", "НДВЕИ", 2, null, 10L, "Град в Рило - Родопската област, известен с минералните си извори.", 2 },
                    { 21, 10L, "Е В Р О П А", null, 1, null, 10L, "В кой континент се намира България?", 2 },
                    { 22, 30L, "О С Т Р О В", null, 1, null, 30L, "Суша, заобградена от всички страни с вода.", 2 },
                    { 23, 20L, "Р У Д И", null, 1, null, 20L, "Скали, от които след преработка се получават метали.", 2 },
                    { 24, 10L, "Д У Н А В", null, 1, null, 10L, "Българска гранична река. Тя е границата между България и Румъния.", 2 },
                    { 25, 30L, "Б Ъ Л Г А Р И Я", null, 1, null, 30L, "Държава на Балканския полуостров, която е на четвърто място по големина.", 2 },
                    { 26, 20L, "С Ъ Р Б И Я", null, 1, null, 20L, "Държава, с която граничим на запад.", 2 },
                    { 27, 10L, "И С К Ъ Р", null, 1, null, 10L, "Коя е най-дългата българска река?", 2 },
                    { 28, 30L, "Р Е З Е Р В А Т", null, 1, null, 30L, "Защитено място, където се опазват редки растителни и животински видове.", 2 },
                    { 29, 20L, "Г Ъ Р Ц И Я", null, 1, null, 20L, "Държава, с която граничим на юг.", 2 },
                    { 30, 10L, "С О Ф И Я", null, 1, null, 10L, "Столицата на нашата държава.", 2 },
                    { 31, 30L, "К О З Л О Д У Й", null, 1, null, 30L, "Град в България. Там има атомна електроцентрала.", 2 },
                    { 32, 20L, "Д О Б Р У Д Ж А", null, 1, null, 20L, "Житницата на България.", 2 },
                    { 33, 10L, "Р У С Е", null, 1, null, 10L, "Голямо селище в Дунавската равнина. Намира се на река Дунав.", 2 },
                    { 34, 30L, "С Р Е Б Ъ Р Н А", null, 1, null, 30L, "Резерват, западно от град Силистра, езеро, свързано с река Дунав -  220 вида птици - пеликани, чапли, патици.", 2 },
                    { 35, 20L, "Б О Т Е В", null, 1, null, 20L, "Най-високият връх в Стара планина. Висок е 2376 м.", 2 },
                    { 36, 10L, "Р И Л А", null, 1, null, 10L, "Най- високият връх в България е Мусала - 2925 м. В коя планина се намира той?", 2 },
                    { 55, 10L, "МАРИЦА", "АМЦАИР", 2, null, 10L, "Река, извираща от Рила планина. Протича през град Пловдив.", 2 },
                    { 56, 20L, "АРДА", "АДАР", 2, null, 20L, "Голяма река в  Рило - Родопската област. Протича през град Кърджали.", 2 },
                    { 57, 30L, "ВИХРЕН", "НВИЕРХ", 2, null, 30L, "Кой е най-високият връх в Пирин планина? Висок е 2914 м.", 2 },
                    { 98, 20L, "Мусала е най-високият връх в България.", null, 3, null, 20L, "Подредете думите в изречение!", 2 },
                    { 20, 20L, "С Е Д Е М", null, 1, null, 20L, "Колко са континентите на земята?", 2 },
                    { 99, 30L, "На запад граничим със Сърбия.", null, 3, null, 30L, "Подредете думите в изречение!", 2 },
                    { 101, 20L, "В Поморие се добива морска сол.", null, 3, null, 20L, "Подредете думите в изречение!", 2 },
                    { 143, 30L, "паметник на Съединението в град Пловдив", "паметник на Съединението в град Пловдив  паметник на Асеневци във Велико Търново  паметник на цар Самуил", 4, "vapros35.png", 30L, "Кой е този паметник?", 2 },
                    { 144, 20L, "Царевец", "Самуилова крепост  Царевец  Мадарска крепост", 4, "vapros36.jpg", 20L, "Коя е тази крепост?", 2 },
                    { 163, 10L, "ГЕРБ", "1. 4-та буква от азбуката. 2. 6-та буква от азбуката. 3. 17-та буква от азбуката. 4. 2-ра буква от азбуката.", 5, null, 10L, "Отгатнете шифъра! Това е един от държавните символи на България.", 2 },
                    { 164, 20L, "КМЕТ", "1. 11-та буква от азбуката. 2. 13-та буква от азбуката. 3. 6-та буква от азбуката. 4. 19-та буква от азбуката.", 5, null, 20L, "Отгатнете шифъра! Това е избран от гражданите представител, който управлява община, град или село.", 2 },
                    { 165, 30L, "РУДИ", "1. 17-та буква от азбуката. 2. 20-та буква от азбуката. 3. 5-та буква от азбуката. 4. 9-та буква от азбуката.", 5, null, 30L, "Отгатнете шифъра! Скали, от които след преработка се получават метали. Как се наричат те?", 2 },
                    { 166, 10L, "ЗНАМЕ", "1. 8-ма буква от азбуката. 2. 14-та буква от азбуката. 3. 1-ва буква от азбуката. 4. 13-та буква от азбуката. 5. 6-та буква от азбуката.", 5, null, 10L, "Разгадайте шифъра! Това е един от държавните символи на Република България", 2 },
                    { 167, 20L, "ТОР", "1. 19-та буква от азбуката. 2. 15-та буква от азбуката. 3. 17-та буква от азбуката.", 5, null, 20L, "Разгадайте шифъра! Вещество, използвано, за да се увеличат изкуствено плодородието на почвите.", 2 },
                    { 168, 30L, "РИС", "1. 17-та буква от азбуката. 2. 9-та буква от азбуката. 3. 18-та буква от азбуката.", 5, null, 30L, "Разгадайте шифъра! Това е защитено от изчезване животно, вписано в Червената книга на България.", 2 },
                    { 142, 10L, "Боят на връх Шипка", "Боят на връх Шипка  Атаката на Одрин  Боят при Чаталджа", 4, "vapros34.jpg", 10L, "Художникът Димитър Гюдженов е пресъздал епизод от славната българска история. Как се нарича тази картина?", 2 },
                    { 169, 10L, "ХИМН", "1. 22-ра буква от азбуката. 2. 9-та буква от азбуката. 3. 13-та буква от азбуката. 4. 14-та буква от азбуката.", 5, null, 10L, "Разгадайте шифъра! Един от държавните символи на България", 2 },
                    { 171, 30L, "БОРИС", "1. 2-ра буква от азбуката. 2. 15-та буква от азбуката. 3. 17-та буква от азбуката. 4. 9-та буква от азбуката. 5. 18-та буква от азбуката.", 5, null, 30L, "Разгадайте шифъра! Това е името на български цар, наследил Фердинанд след войните за обединение и управлявал от 1918 до 1943 година.", 2 },
                    { 172, 10L, "СОФИЯ", "1. 18-та буква от азбуката. 2. 15-та буква от азбуката. 3. 21-ва буква от азбуката. 4. 9-та буква от азбуката. 5. 30-та буква от азбуката.", 5, null, 10L, "Разгадайте шифъра!Преходната област е най-населената част от България. Там се намира и нашата столица. Коя е тя?", 2 },
                    { 173, 20L, "ТРОЯН", "1. 19-та буква от азбуката. 2. 17-та буква от азбуката. 3. 15-та буква от азбуката. 4. 30-та буква от азбуката. 5. 14-та буква от азбуката.", 5, null, 20L, "Разгадайте шифъра! Кой е този град в България, известен с развитието на занаятите, основно грънчарство?", 2 },
                    { 174, 30L, "ВИТ", "1. 3-та буква от азбуката. 2. 9-та буква от азбуката. 3. 19-та буква от азбуката.", 5, null, 30L, "Разгадайте шифъра! Името на река, извираща от Стара планина.", 2 },
                    { 175, 20L, "ИСКЪР", "1. 9-та буква от азбуката. 2. 18-та буква от азбуката. 3. 11-та буква от азбуката. 4. 27-ма буква от азбуката. 5. 17-та буква от азбуката.", 5, null, 20L, "Разгадайте шифъра! Името на река, извираща от Рила планина.", 2 },
                    { 176, 10L, "ДУНАВ", "1. 5-та буква от азбуката. 2. 20-та буква от азбуката. 3. 14-та буква от азбуката. 4. 1-ва буква от азбуката. 5. 3-та буква от азбуката.", 5, null, 10L, "Разгадайте шифъра! Името на българска гранична река. Тя е границата между България и Румъния. ", 2 },
                    { 177, 30L, "БОТЕВ", "1. 2-ра буква от азбуката. 2. 15-та буква от азбуката. 3. 19-та буква от азбуката. 4. 6-та буква от азбуката. 5. 3-та буква от азбуката.", 5, null, 30L, "Разгадайте шифъра! Името на най-високия връх в Стара планина.", 2 },
                    { 178, 10L, "РИЛА", "1. 17-та буква от азбуката. 2. 9-та буква от азбуката. 3. 12-та буква от азбуката. 4. 1-ва буква от азбуката.", 5, null, 10L, "Разгадайте шифъра! Името на най-високата планина в България.", 2 },
                    { 170, 20L, "АРДА", "1. 1-ва буква от азбуката. 2. 17-та буква от азбуката. 3. 5-та буква от азбуката. 4. 1-ва буква от азбуката.", 5, null, 20L, "Разгадайте шифъра! Голяма река, протичаща през Рило - Родопската област.", 2 },
                    { 141, 30L, "Райското пръскало", "Водно огледало  Райското пръскало  Течащите скали", 4, "vapros33.jpg", 30L, "Това е най-високият водопад у нас.Как се нарича?", 2 },
                    { 140, 20L, "Богоявление", "Васильовден  Ивановден  Богоявление", 4, "vapros32.jpg", 20L, "На кой празник мъжете от Калофер играят в ледените води на река Тунджа хоро, признато за единствена традиция в света?", 2 },
                    { 139, 10L, "Народно събрание", "Министерски съвет  Народно събрание  Президенство", 4, "vapros31.jpg", 10L, "Името на сградата, която виждате", 2 },
                    { 102, 30L, "Конституцията е основният закон на държавата.", null, 3, null, 30L, "Подредете думите в изречение!", 2 },
                    { 103, 10L, "Пловдив е разположен на река Марица.", null, 3, null, 10L, "Подредете думите в изречение!", 2 },
                    { 104, 20L, "Девин е известен с минералните си извори.", null, 3, null, 20L, "Подредете думите в изречение!", 2 },
                    { 105, 30L, "Континентите на Земята са седем.", null, 3, null, 30L, "Подредете думите в изречение!", 2 },
                    { 106, 10L, "Варна е морската столица на България.", null, 3, null, 10L, "Подредете думите в изречение!", 2 },
                    { 107, 20L, "На юг граничим с Гърция.", null, 3, null, 20L, "Подредете думите в изречение!", 2 },
                    { 108, 30L, "Муфлонът е застрашено от изчезване животно.", null, 3, null, 30L, "Подредете думите в изречение!", 2 },
                    { 127, 10L, "Васил Левски", "Васил Левски  Христо Ботев  Иван Вазов", 4, "vapros19.jpeg", 10L, "Кой велик българин е изобразен на долната картинка?", 2 },
                    { 128, 20L, "Христо Ботев", "Васил Левски  Христо Ботев  Георги Раковски", 4, "vapros20.jpg", 20L, "Това е един от водачите на българите, в борбата им за свобода", 2 },
                    { 129, 30L, "Георги Раковски", "Христо Ботев  Васил Левски  Георги Раковски", 4, "vapros21.jpg", 30L, "Това е един от водачите на българите, в борбата им за свобода", 2 },
                    { 130, 20L, "Георги Бенковски", "Георги Раковски  Георги Бенковски  Христо Ботев", 4, "vapros22.jpeg", 20L, "Това е един от водачите на българите, в борбата им за свобода - предводител на Хвърковатата чета по време на Априлското въстание.", 2 },
                    { 131, 10L, "Герб на Република България", "Герб на Княжество България  Герб на Република България  Герб на град София", 4, "vapros23.jpg", 10L, "Познайте кой е изобразеният на илюстрацията герб?", 2 },
                    { 132, 30L, "Герб на Княжество България", "Герб на Княжество България  Герб на Република България  Герб на град София", 4, "vapros24.png", 30L, "Познайте кой е изобразеният на илюстрацията герб?", 2 },
                    { 133, 20L, "Герб на град София", "Герб на Княжество България  Герб на Република България  Герб на град София", 4, "vapros25.png", 20L, "Познайте кой е изобразеният на илюстрацията герб?", 2 },
                    { 134, 10L, "Сграда на Президенството", "Сграда на Президенството  Сграда на Народното събрание  Сграда на Министерски съвет", 4, "vapros26.jpg", 10L, "Коя е сградата изобразена на илюстрацията?", 2 },
                    { 135, 30L, "Паисий Хилендарски", "Софроний Врачански  Петър Берон  Паисий Хилендарски", 4, "vapros27.jpg", 30L, "Кой е този български възрожденец?", 2 },
                    { 136, 10L, "Румъния", "Сърбия  Турция  Румъния", 4, "vapros28.jpg", 10L, "С коя държава граничим на север?", 2 },
                    { 137, 20L, "Министерски съвет", "Министерски съвет  Народно събрание  Президенство", 4, "vapros29.jpg", 20L, "Името на сградата, която виждате.", 2 },
                    { 138, 30L, "Стефан Стамболов", "Петко Каравелов  Стефан Стамболов  Константин Стоилов", 4, "vapros30.jpg", 30L, "Това е един от най-изявените политици на България след Освобождението от турско робство. Бил е председател на Народното събрание, последовател на Васил Левски и апостол по време на Априлското въстание.", 2 },
                    { 100, 10L, "Българите превземат Одрин.", null, 3, null, 10L, "Подредете думите в изречение!", 2 },
                    { 19, 30L, "Г Л О Б У С", null, 1, null, 30L, "Изображение на земното кълбо в умален вид.", 2 },
                    { 162, 30L, "ПЧЕЛА", "1. 16-та буква от азбуката. 2. 24-та буква от азбуката. 3. 6-та буква от азбуката. 4. 12-та буква от азбуката. 5. 1-ва буква от азбуката.", 5, null, 30L, "Отгатнете шифъра! Това е животно, което няма бели дробове и диша чрез тънки разклонени тръбички / трахеи /.", 1 },
                    { 161, 20L, "БЯС", "1. 2-ра буква от азбуката. 2. 30-та буква от азбуката. 3. 18-та буква от азбуката.", 5, null, 20L, "Отгатнете шифъра! Това е болест, която се причинява при ухапване от куче.", 1 },
                    { 43, 30L, "ЗВУК", "УВКЗ", 2, null, 30L, "Как се наричат разпространените във въздуха трептения?", 1 },
                    { 44, 20L, "ПЯСЪК", "КСПЯЪ", 2, null, 20L, "Една от съставките на почвата, благодарение на която се задържа малко вода.", 1 },
                    { 45, 10L, "НЕФТ", "ТФНЕ", 2, null, 10L, "Един от замърсителите на водата.", 1 },
                    { 46, 10L, "СЛЪНЦЕ", "ЕНЦСЪЛ", 2, null, 10L, "Най-големият източник на светлина.", 1 },
                    { 47, 20L, "ЛУНА", "УЛАН", 2, null, 20L, "Кой е естественият спътник на Земята?", 1 },
                    { 48, 30L, "ЗРЕНИЕ", "ЕРЕЗНИ", 2, null, 30L, "Как се нарича способността на човека да вижда телата около себе си и да разпознава цветовете?", 1 },
                    { 49, 30L, "ПЛАНЕТА", "АПТЛАНЕ", 2, null, 30L, "Небесно тяло, което не излъчва собствена светлина и топлина, а свети с отразена слънчева светлина.", 1 },
                    { 50, 20L, "ЗВЕЗДА", "АЗДВЗЕ", 2, null, 20L, "Небесно тяло, което излъчва собствена светлина и топлина", 1 },
                    { 42, 30L, "ЕНЕРГИЯ", "ГИЯРЕНЕ", 2, null, 30L, "Как наричаме способността на тялото да извършва работа?", 1 },
                    { 51, 10L, "ЗЕМЯ", "МЕЯЗ", 2, null, 10L, "Планета от Слънчевата система, на която има живот.", 1 },
                    { 53, 20L, "ЮПИТЕР", "РПЮЕТИ", 2, null, 20L, "Най-голямата планета в Слънчевата система.", 1 },
                    { 54, 10L, "ИЗТОК", "ТОКЗИ", 2, null, 10L, "От каква посока изгрява Слънцето сутрин?", 1 },
                    { 73, 10L, "Почвата съдържа различни вещества.", null, 3, null, 10L, "Подредете думите в изречение!", 1 },
                    { 74, 20L, "Плодородната почва съдържа повече хумус.", null, 3, null, 20L, "Подредете думите в изречение!", 1 },
                    { 75, 30L, "Шумът е вреден за човешкото здраве.", null, 3, null, 30L, "Подредете думите в изречение!", 1 },
                    { 76, 10L, "Пазете природата чиста!", null, 3, null, 10L, "Подредете думите в изречение!", 1 },
                    { 77, 20L, "Земята има формата на кълбо.", null, 3, null, 20L, "Подредете думите в изречение!", 1 },
                    { 78, 30L, "Слънцето е най-големият източник на светлина.", null, 3, null, 30L, "Подредете думите в изречение!", 1 },
                    { 52, 30L, "МАРС", "СРАМ", 2, null, 30L, "Четвъртата планета от Слънчевата система. Наричат я червената планета.", 1 },
                    { 41, 20L, "ГОРИВО", "ОРИГОВ", 2, null, 20L, "Какво е необходимо на автобуса, за да се движи?", 1 },
                    { 40, 10L, "ВЕРИГИ", "ИРВИЕГ", 2, null, 10L, "Какво слагат на гумите на автомобила шофьорите през зимата, за да  се предпазят от подхлъзване?", 1 },
                    { 39, 30L, "ШУМ", "УМШАВ", 2, null, 30L, "Как наричаме смесването на различни звуци?", 1 },
                    { 2, 10L, "Д Ъ Р В О", null, 1, null, 10L, "Вещество, което може да гори и се използва за отопление.", 1 },
                    { 3, 20L, "М Е Т А Л И", null, 1, null, 20L, "Как наричаме най-добрите проводници на топлина? От тях се изработват отоплителни уреди, домакински съдове и др.", 1 },
                    { 4, 30L, "В Ъ Л Н А", null, 1, null, 30L, "Вещество, което не пропуска топлината да премине през него. Използва се за изработването на дрехи. Носим ги през зимата.", 1 },
                    { 5, 20L, "М А Г Н И Т", null, 1, null, 20L, "Привлича предмети направени от желязо, стомана и някои други метали.", 1 },
                    { 6, 10L, "Т О П К А", null, 1, null, 10L, "Тяло, което е по-леко от водата. Можем да играем с него.", 1 },
                    { 7, 10L, "М О Н Е Т А", null, 1, null, 10L, "Тяло, което е по-тежко от водата. Можем да си купим нещо с него.", 1 },
                    { 8, 20L, "Т Е Р М О М Е Т Ъ Р", null, 1, null, 20L, "Специален уред за точното измерване на температурата.", 1 },
                    { 9, 30L, "С И Н О П Т И Ц И", null, 1, null, 30L, "Как се наричат хората, които изработват прогнозата за времето?", 1 },
                    { 10, 10L, "В О Д А", null, 1, null, 10L, "Вещество в природата, без което животът на организмите - хора, животни, растения е немислим.", 1 },
                    { 11, 20L, "Л Е Д", null, 1, null, 20L, "Водата се среща в три агрегатни състояния - твърдо, течно и газообразно. Как наричаме водата, когато е в твърдо състояние?", 1 },
                    { 12, 30L, "Б У Р Я", null, 1, null, 30L, "Какво наближава ако мравките бързат към мравуняците си?", 1 },
                    { 13, 10L, "С Н Я Г", null, 1, null, 10L, "Има различни видове валежи. Какво вали през зимата?", 1 },
                    { 14, 20L, "Г Р А Д У Ш К А", null, 1, null, 20L, "Как се нарича валежът, когато водните капки падат на земята като твърди ледени зърна?", 1 },
                    { 15, 30L, "К Р Ъ Г О В Р А Т", null, 1, null, 30L, "Как се нарича постоянното преминаване на водата от едно състояние в друго?", 1 },
                    { 16, 20L, "П О Ч В А", null, 1, null, 20L, "Как се нарича най-горният рохкав слой на земята?", 1 },
                    { 17, 30L, "С Л У Х", null, 1, null, 30L, "Как се нарича способността на ушите да чуват звуци?", 1 },
                    { 18, 10L, "У Х О", null, 1, null, 10L, "Сетивен орган, с който чуваме звуци.", 1 },
                    { 37, 20L, "ХУМУС", "УХСМУ", 2, null, 20L, "Съставка на почвата, която се образува от изгнили части на растения, измрели животни и други организми. Богата е на хранителни вещества.", 1 },
                    { 38, 10L, "ПРАХ", "ГТСХАЕПОРБЛЯ", 2, null, 10L, "Нещо, което замърсява въздуха.", 1 },
                    { 79, 10L, "Юпитер е най-голямата планета.", null, 3, null, 10L, "Подредете думите в изречение!", 1 },
                    { 80, 20L, "Луната обикаля около Земята.", null, 3, null, 20L, "Подредете думите в изречение!", 1 },
                    { 81, 30L, "Около Слънцето обикалят осем планети.", null, 3, null, 30L, "Подредете думите в изречение!", 1 },
                    { 82, 10L, "Глиганът е всеядно животно.", null, 3, null, 10L, "Подредете думите в изречение!", 1 },
                    { 124, 10L, "сива чапла", "голяма бяла чапла  чайка  сива чапла", 4, "vapros16.jpg", 10L, "Кое е това животно?", 1 },
                    { 125, 20L, "голяма бяла чапла", "голяма бяла чапла  чайка  сива чапла", 4, "vapros17.jpg", 20L, "Кое е това животно?", 1 },
                    { 126, 30L, "златка", "дива котка  златка  пъстър пор", 4, "vapros18.jpg", 30L, "Кое е това животно?", 1 },
                    { 145, 10L, "КОН", "1. 11-та буква от азбуката. 2. 15-та буква от азбуката. 3. 14-та буква от азбуката.", 5, null, 10L, "Разгадайте шифъра! Това е тревопасно животно, което може да се язди", 1 },
                    { 146, 20L, "ОРЕЛ", "1. 15-та буква от азбуката. 2. 17-та буква от азбуката. 3. 6-та буква от азбуката. 4. 12-та буква от азбуката.", 5, null, 20L, "Разгадайте шифъра! Хищна птица - има отлично зрение, силни мускули, здрави нокти и остра извита човка", 1 },
                    { 147, 30L, "СОВА", "1. 18-та буква от азбуката. 2. 15-та буква от азбуката. 3. 3-та буква от азбуката. 4. 1-ва буква от азбуката.", 5, null, 30L, "Разгадайте шифъра! Нощна граблива птица", 1 },
                    { 148, 10L, "ЛЪВ", "1. 12-та буква от азбуката. 2. 27-ма буква от азбуката. 3. 3-та буква от азбуката.", 5, null, 10L, "Разгадайте шифъра! Хищен бозайник. Това е царят на животните.", 1 },
                    { 149, 20L, "ЕЛЕН", "1. 6-та буква от азбуката. 2. 12-та буква от азбуката. 3. 6-та буква от азбуката. 4. 14-та буква от азбуката.", 5, null, 20L, "Отгатнете шифъра!  Красиво тревопасно горско животно с големи рога.", 1 },
                    { 150, 30L, "ЖАБА", "1. 7-ма буква от азбуката. 2. 1-ва буква от азбуката. 3. 2-ра буква от азбуката. 4. 1-ва буква от азбуката.", 5, null, 30L, "Разгадайте шифъра! Животно с дълъг лепкав език, с който улавя различни насекоми. Живее във водата и на сушата.", 1 },
                    { 151, 10L, "КИТ", "1. 11-та буква от азбуката. 2. 9-та буква от азбуката. 3. 19-та буква от азбуката.", 5, null, 10L, "Отгатнете шифъра!  Най-големият морски бозайник.", 1 },
                    { 152, 20L, "ДЪБ", "1. 5-та буква от азбуката. 2. 27-ма буква от азбуката. 3. 2-ра буква от азбуката.", 5, null, 20L, "Разгадайте шифъра! Широколистно дърво, растящо в ниските планински места. Ражда жълъди, които са храна за дивите прасета.", 1 },
                    { 153, 30L, "БРЕЗА", "1. 2-ра буква от азбуката. 2. 17-та буква от азбуката. 3. 6-та буква от азбуката. 4. 8-ма буква от азбуката. 5. 1-ва буква от азбуката.", 5, null, 30L, "Отгатнете шифъра! Високо широколистно дърво с бяло стъбло.", 1 },
                    { 154, 10L, "ШАРАН", "1. 25-та буква от азбуката. 2. 1-ва буква от азбуката. 3. 17-та буква от азбуката. 4. 1-ва буква от азбуката. 5. 14-та буква от азбуката.", 5, null, 10L, "Разгадайте шифъра! Това е речна риба, която приготвяме за Никулден.", 1 },
                    { 155, 20L, "СЪРЦЕ", "1. 18-та буква от азбуката. 2. 27-ма буква от азбуката. 3. 17-та буква от азбуката. 4. 23-та буква от азбуката. 5. 6-та буква от азбуката.", 5, null, 20L, "Разгадайте шифъра! Кой е този важен човешки орган? Непрекъснато се свива и разпуска и движи кръвта в нашето тяло.", 1 },
                    { 156, 30L, "ЛАЛЕ", "1. 12-та буква от азбуката. 2. 1-ва буква от азбуката. 3. 12-та буква от азбуката. 4. 6-та буква от азбуката.", 5, null, 30L, "Отгатнете шифъра! Пролетно цвете с различни цветове, което се размножава чрез луковици.", 1 },
                    { 157, 10L, "СЛОН", "1. 18-та буква от азбуката. 2. 12-та буква от азбуката. 3. 15-та буква от азбуката. 4. 14-та буква от азбуката.", 5, null, 10L, "Разгадайте шифъра! Най-големият сухоземен бозайник . Има хобот.", 1 },
                    { 158, 20L, "ХРИЛЕ", "1. 22-ра буква от азбуката. 2. 17-та буква от азбуката. 3. 9-та буква от азбуката. 4. 12-та буква от азбуката. 5. 6-та буква от азбуката.", 5, null, 20L, "Разгадайте шифъра! С какво дишат рибите?", 1 },
                    { 159, 30L, "МАРС", "1. 13-та буква от азбуката. 2. 1-ва буква от азбуката. 3. 17-та буква от азбуката. 4. 18-та буква от азбуката.", 5, null, 30L, "Разгадайте шифъра! Четвъртата планета от Слънчевата система. Наричат я червената планета.", 1 },
                    { 160, 10L, "НОС", "1. 14-та буква от азбуката. 2. 15-та буква от азбуката. 3. 18-та буква от азбуката.", 5, null, 10L, "Разгадайте шифъра! Това е орган на дишането. С него долавяме различни миризми.", 1 },
                    { 123, 30L, "лалугер", "попово прасе  сляпо куче  лалугер", 4, "vapros15.jpg", 30L, "Кое е това животно?", 1 },
                    { 179, 20L, "РУСЕ", "1. 17-та буква от азбуката. 2. 20-та буква от азбуката. 3. 18-та буква от азбуката. 4. 6-та буква от азбуката.", 5, null, 20L, "Разгадайте шифъра! Името на голям български град в Дунавската равнина. Намира се на река Дунав.", 2 },
                    { 122, 20L, "слънчеви панели", "ветрогенератор  оранжерия  слънчеви панели", 4, "vapros14.jpg", 20L, "Какво виждате на изображението?", 1 },
                    { 120, 10L, "розов пеликан", "червен ангъч  сив жерав  розов пеликан", 4, "vapros12.jpg", 10L, "Кое е това животно - изчезнал вид?  Вписано е в Червената книга на България?", 1 },
                    { 83, 20L, "Спазвай добра лична хигиена!", null, 3, null, 20L, "Подредете думите в изречение!", 1 },
                    { 84, 30L, "Земята обикаля около Слънцето.", null, 3, null, 30L, "Подредете думите в изречение!", 1 },
                    { 85, 10L, "Орелът има отлично зрение.", null, 3, null, 10L, "Подредете думите в изречение!", 1 },
                    { 86, 20L, "Прилепите са летящи бозайници.", null, 3, null, 20L, "Подредете думите в изречение!", 1 },
                    { 87, 30L, "Яйцата на рибите се наричат хайвер.", null, 3, null, 30L, "Подредете думите в изречение!", 1 },
                    { 88, 10L, "Жабата е земноводно животно.", null, 3, null, 10L, "Подредете думите в изречение!", 1 },
                    { 89, 20L, "Алкохолът уврежда човешкия организъм.", null, 3, null, 20L, "Подредете думите в изречение!", 1 },
                    { 90, 30L, "Спазвайте добра лична хигиена!", null, 3, null, 30L, "Подредете думите в изречение!", 1 },
                    { 109, 10L, "Юпитер", "Сатурн  Юпитер  Земя", 4, "vapros1.jpeg", 10L, "Коя планета е посочена на снимката? Това е най-голямата планета в Слънчевата Система.", 1 },
                    { 110, 20L, "Сатурн", "Венера  Юпитер  Сатурн", 4, "vapros2.jpg", 20L, "Името на планета от Слънчевата система.", 1 },
                    { 111, 30L, "къртица", "попово прасе  лалугер  къртица", 4, "vapros3.jpg", 30L, "Кое е изобразеното на снимката животно?", 1 },
                    { 112, 10L, "черен щъркел", "бял щъркел  пъстър щъркер  черен щъркел", 4, "vapros4.jpg", 10L, "Кое е това животно?  Вписано е в Червената книга на България?", 1 },
                    { 113, 30L, "белогърб кълвач", "пъстър кълвач  дребен кълвач  белогърб кълвач", 4, "vapros5.jpg", 30L, "Кое е това животно?  Вписано е в Червената книга на България?", 1 },
                    { 114, 20L, "черен кълвач", "белезникав кълвач  черен кълвач  шарен кълвач", 4, "vapros6.jpg", 20L, "Кое е това животно?  Вписано е в Червената книга на България?", 1 },
                    { 115, 30L, "малък креслив орел", "сокол орко  малък креслив орел  голям ястреб", 4, "vapros7.jpg", 30L, "Кое е това животно?  Вписано е в Червената книга на България?", 1 },
                    { 116, 20L, "скален орел", "орел змияр  сокол орко  скален орел", 4, "vapros8.jpg", 20L, "Кое е това животно?  Вписано е в Червената книга на България?", 1 },
                    { 117, 10L, "орел змияр", "скален орел  орел змияр  малък креслив орел", 4, "vapros9.jpg", 10L, "Кое е това животно?  Вписано е в Червената книга на България?", 1 },
                    { 118, 30L, "голям ястреб", "голям ястреб  сокол орко  ловен сокол", 4, "vapros10.jpg", 30L, "Кое е това животно?  Вписано е в Червената книга на България?", 1 },
                    { 119, 20L, "брадат лешояд", "черен лешояд  брадат лешояд  бекасина", 4, "vapros11.jpeg", 20L, "Кое е това животно - изчезнал вид?  Вписано е в Червената книга на България?", 1 },
                    { 121, 10L, "ветрогенератор", "вятърна мелница  ветрогенератор  въртележка", 4, "vapros13.jpg", 10L, "Какво виждате на изображението?", 1 },
                    { 180, 30L, "ГУЩЕР", "1. 4-та буква от азбуката. 2. 20-та буква от азбуката. 3. 26-та буква от азбуката. 4. 6-та буква от азбуката. 5. 17-та буква от азбуката.", 5, null, 30L, "Разгадайте шифъра! Животно с дълъг лепкав език, с който улавя различни насекоми.", 2 }
                });

            migrationBuilder.CreateIndex(
                name: "IX_Games_GameTypeId",
                table: "Games",
                column: "GameTypeId");

            migrationBuilder.CreateIndex(
                name: "IX_Games_SubjectId",
                table: "Games",
                column: "SubjectId");

            migrationBuilder.CreateIndex(
                name: "IX_StudentGames_GameId",
                table: "StudentGames",
                column: "GameId");

            migrationBuilder.CreateIndex(
                name: "IX_Students_ResourceTeacherId",
                table: "Students",
                column: "ResourceTeacherId");

            migrationBuilder.CreateIndex(
                name: "IX_Students_TeacherId",
                table: "Students",
                column: "TeacherId");
        }

        protected override void Down(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.DropTable(
                name: "StudentGames");

            migrationBuilder.DropTable(
                name: "Games");

            migrationBuilder.DropTable(
                name: "Students");

            migrationBuilder.DropTable(
                name: "GameTypes");

            migrationBuilder.DropTable(
                name: "Subjects");

            migrationBuilder.DropTable(
                name: "ResourceTeachers");

            migrationBuilder.DropTable(
                name: "Teachers");
        }
    }
}
